<?php
// Version: 2.0; Themes

// Important! Before editing these language files please read the text at the top of index.english.php.
$txt['themeadmin_explain'] = 'Раздел тем оформления очень важная составляющая форума. Настройки, расположенные здесь, помогут выбрать тему оформления или установить новую.';

$txt['theme_allow'] = 'Разрешить пользователям выбирать себе темы оформления.';
$txt['theme_guests'] = 'Сменить по умолчанию';
$txt['theme_select'] = 'выбрать...';
$txt['theme_reset'] = 'Сбросить у каждого на';
$txt['theme_nochange'] = 'Без изменений';
$txt['theme_forum_default'] = 'Тема по умолчанию';

$txt['theme_remove'] = 'удалить';
$txt['theme_remove_confirm'] = 'Уверены, что хотите удалить эту тему?';

$txt['theme_install'] = 'Установить новую тему оформления';
$txt['theme_install_file'] = 'Из файла';
$txt['theme_install_dir'] = 'Из папки на сервере';
$txt['theme_install_error'] = 'Эта папка не существует или не содержит темы оформления!';
$txt['theme_install_write_error'] = 'Для продолжения папка тем оформления должна иметь права на запись!';
$txt['theme_install_go'] = 'Установить';
$txt['theme_install_new'] = 'Создать копию используемой по умолчанию темы';
$txt['theme_install_new_confirm'] = 'Установить новую тему оформления?';
$txt['theme_install_writable'] = 'Внимание - вы не можете создать или установить новую тему оформления, поскольку папка тем оформления не имеет прав на запись!';
$txt['theme_installed'] = 'Установка удачно завершена';
$txt['theme_installed_message'] = 'успешно установлена.';

$txt['theme_latest'] = 'Последние темы оформления';
$txt['theme_latest_fetch'] = 'Невозможно получить информацию о последних темах оформления с www.simplemachines.org...';

$txt['theme_pick'] = 'Выбрать тему оформления...';
$txt['theme_preview'] = 'Просмотреть';
$txt['theme_set'] = 'Использовать эту тему оформления';
$txt['theme_user'] = 'пользователь, использующий эту тему оформления.';
$txt['theme_users'] = 'пользователи, использующие эту тему оформления.';
$txt['theme_pick_variant'] = 'Выберите вариацию';

$txt['theme_edit'] = 'Редактировать тему оформления';
$txt['theme_edit_style'] = 'Изменить файлы стилей (цвета, шрифты, прочее).';
$txt['theme_edit_index'] = 'Изменить шаблон. (шаблон главной страницы)';
$txt['theme_edit_no_save'] = 'Этот файл не может быть сохранен, нет прав на запись. Пожалуйста, установите права на запись (chmod 777)';
$txt['theme_edit_save'] = 'Сохранить изменения';

$txt['theme_global_description'] = 'Это тема по умолчанию. Это означает, что данная тема применяется для всех пользователей, наряду с другими настройками.';

$txt['theme_url_config'] = 'Адрес (URL) и настройка темы оформления';
$txt['theme_variants'] = 'Вариации темы оформления';
$txt['theme_options'] = 'Свойства темы оформления';
$txt['actual_theme_name'] = 'Название темы оформления: ';
$txt['actual_theme_dir'] = 'Папка темы оформления: ';
$txt['actual_theme_url'] = 'Адрес (URL) темы оформления: ';
$txt['actual_images_url'] = 'Адрес (URL) картинок для темы оформления: ';
$txt['current_theme_style'] = 'Стиль темы оформления: ';

$txt['theme_variants_default'] = 'Вариация темы, выбранная по умолчанию';
$txt['theme_variants_user_disable'] = 'Запретить пользователям выбирать вариацию темы';

$txt['site_slogan'] = 'Девиз сайта';
$txt['site_slogan_desc'] = 'Добавьте здесь свой девиз. Он будет отображаться вместо логотипа SMF.';
$txt['forum_width'] = 'Ширина форума';
$txt['forum_width_desc'] = 'Установить ширину форума (в пикселах или процентах). Например: 950px, 80%, 1240px.';

$txt['enable_random_news'] = 'Включить отображение случайной новости наверху форума';
$txt['show_group_key'] = 'Показывать названия групп на главной странице';
$txt['additional_options_collapsable'] = 'Разрешить сворачивать дополнительные настройки отправки сообщений';
$txt['allow_no_censored'] = 'Разрешить пользователям выключать цензуру';
$txt['who_display_viewing'] = 'Показывать кто просматривает раздел';
$txt['who_display_viewing_off'] = 'Не показывать';
$txt['who_display_viewing_numbers'] = 'Показывать количество пользователей';
$txt['who_display_viewing_names'] = 'Показывать имена пользователей';
$txt['disable_recent_posts'] = 'Запретить последние сообщения';
$txt['enable_single_post'] = 'Разрешить одиночные сообщения';
$txt['enable_multiple_posts'] = 'Разрешить множественные сообщения';
$txt['enable_inline_links'] = 'Отображать ссылки местоположения в линию';
$txt['inline_desc'] = 'При включении данной функции, ссылки местоположения пользователей на форуме, будут расположены в линию (По умолчанию в виде дерева).';
$txt['show_stats_index'] = 'Отображать статистику на главной странице';
$txt['latest_members'] = 'Показывать нового пользователя на главной странице форума';
$txt['last_modification'] = 'Показывать дату последнего редактирования в измененных сообщениях';
$txt['user_avatars'] = 'Показывать аватары пользователей при просмотре сообщений';
$txt['user_text'] = 'Показывать подписи под аватарами в просмотре сообщений';
$txt['gender_images'] = 'Показывать пол пользователя в просмотре сообщений';
$txt['news_fader'] = 'Показывать прокрутку новостей на главной странице форума';
$txt['member_list_bar'] = 'Показывать список пользователей на главной странице форума';
$txt['current_pos_text_img'] = 'Показывать текущее местоположение на форуме как ссылку вместо текста';
$txt['show_view_profile_button'] = 'Показывать под аватарами кнопки для связи с авторами сообщений';
$txt['enable_mark_as_read'] = 'Разрешить и показывать кнопки \'Отметить прочитанными\'';
$txt['header_logo_url'] = 'Адрес (URL) изображения логотипа';
$txt['header_logo_url_desc'] = 'Оставьте пустым для отображения названия форума и логотипа по умолчанию.';
$txt['number_recent_posts'] = 'Количество последних сообщений на главной странице форума';
$txt['number_recent_posts_desc'] = 'Для запрета отображения последних сообщений поставьте значение 0.';
$txt['hide_post_group'] = 'Не отображать в сообщениях название группы пользователей';
$txt['hide_post_group_desc'] = 'Название группы, основанной на количестве сообщений, отображаться в сообщениях не будет.';

$txt['theme_options_defaults'] = 'Здесь расположены значения для пользователей по умолчанию. Сделанные здесь изменения повлияют только на новых пользователей и гостей.';
$txt['theme_options_title'] = 'Изменить или сбросить значения по умолчанию';

$txt['themeadmin_title'] = 'Темы оформления';
$txt['themeadmin_description'] = 'Здесь можно изменить настройки тем оформлений, установить новые темы, а также изменить параметры отображения тем.';
$txt['themeadmin_admin_desc'] = 'Здесь можно установить новую тему оформления, изменить её&nbsp;настройки и&nbsp;т.&nbsp;д.';
$txt['themeadmin_list_desc'] = 'Здесь можно просмотреть список всех установленных на форуме тем оформления, изменить их пути и настройки, либо удалить их.';
$txt['themeadmin_reset_desc'] = 'Ниже можно изменить настройки текущей темы оформления для зарегистрированных пользователей.';
$txt['themeadmin_edit_desc'] = 'Изменение отображения и исходного текста вашей темы оформления.';

$txt['themeadmin_list_heading'] = 'Обзор настроек установленных тем оформления';
$txt['themeadmin_list_tip'] = 'Настройки разных тем оформления могут отличаться друг от друга. Нажмите на название темы, чтобы изменить её основные параметры.';
$txt['themeadmin_list_theme_dir'] = 'Директория темы (шаблонов)';
$txt['themeadmin_list_invalid'] = '(внимание, путь указан неверно!)';
$txt['themeadmin_list_theme_url'] = 'Адрес (URL) темы оформления';
$txt['themeadmin_list_images_url'] = 'Адрес (URL) изображений';
$txt['themeadmin_list_reset'] = 'Изменение адреса (URL) и директории с темами оформлений';
$txt['themeadmin_list_reset_dir'] = 'Путь к директории с темами оформлений';
$txt['themeadmin_list_reset_url'] = 'Адрес (URL) директории с темами оформлений';
$txt['themeadmin_list_reset_go'] = 'Сохранить';

$txt['themeadmin_reset_tip'] = 'Каждая тема оформления может иметь собственные настройки: &laquo;Быстрый ответ&raquo;, аватары и подписи, параметры отображения и другие. Здесь можно установить настройки, которые будут использоваться по умолчанию.';
$txt['themeadmin_reset_defaults'] = 'Настройки, принятые по умолчанию для гостей и новых пользователей';
$txt['themeadmin_reset_defaults_current'] = 'установленных настроек.';
$txt['themeadmin_reset_members'] = 'Настройки темы оформления для зарегистрированных пользователей';
$txt['themeadmin_reset_remove'] = 'Удалить все настройки пользователей и использовать настройки по умолчанию';
$txt['themeadmin_reset_remove_current'] = 'пользователей, выставивших собственные настройки.';
// Don't use entities in the below string.
$txt['themeadmin_reset_remove_confirm'] = 'Уверены, что хотите удалить все настройки для этой темы?\\nЭто может привести к исчезновению некоторых полей в профилях пользователей.';
$txt['themeadmin_reset_options_info'] = 'Выставленные ниже параметры изменят настройки темы для <em>каждого пользователя</em>.  Чтобы изменить какой-либо пункт, выберите &quot;изменить&quot;, а затем можете выбрать значение для выбранного пункта. Чтобы использовать настройки по умолчанию, выберите пункт &quot;удалить&quot;.  Иначе, можете использовать уже установленное значение, выбрав пункт &quot;не менять&quot;.';
$txt['themeadmin_reset_options_change'] = 'Изменить';
$txt['themeadmin_reset_options_none'] = 'Не менять';
$txt['themeadmin_reset_options_remove'] = 'Удалить';

$txt['themeadmin_edit_browse'] = 'Обзор шаблонов и файлов этой темы оформления.';
$txt['themeadmin_edit_style'] = 'Изменить стили (CSS) этой темы оформления.';
$txt['themeadmin_edit_copy_template'] = 'Копировать шаблон с темы оформления, на которой он основан.';
$txt['themeadmin_edit_exists'] = 'уже существует';
$txt['themeadmin_edit_do_copy'] = 'копировать';
$txt['themeadmin_edit_copy_warning'] = 'Когда форуму необходим шаблон или языковой файл, находящийся не в текущей теме оформления, он берется из темы, на которой основан шаблон, или из темы по умолчанию.';
$txt['themeadmin_edit_copy_confirm'] = 'Уверены, что хотите скопировать этот шаблон?';
$txt['themeadmin_edit_overwrite_confirm'] = 'Уверены, что хотите скопировать этот шаблон поверх уже существующей копии?\\nВсе сделанные ранее изменения НЕ СОХРАНЯТСЯ!';
$txt['themeadmin_edit_no_copy'] = '<em>(невозможно скопировать)</em>';
$txt['themeadmin_edit_filename'] = 'Имя файла';
$txt['themeadmin_edit_modified'] = 'Последнее редактирование';
$txt['themeadmin_edit_size'] = 'Размер';
$txt['themeadmin_edit_bytes'] = 'б';
$txt['themeadmin_edit_kilobytes'] = 'Кб';
$txt['themeadmin_edit_error'] = 'Редактируемый файл вызвал следующую ошибку:';
$txt['themeadmin_edit_on_line'] = 'Строка';
$txt['themeadmin_edit_preview'] = 'Предварительный просмотр';
$txt['themeadmin_selectable'] = 'Темы оформления, разрешенные для выбора';
$txt['themeadmin_themelist_link'] = 'Отобразить список тем оформления';

?>